       IDENTIFICATION DIVISION.
       PROGRAM-ID. INTCALC.
       AUTHOR. MUSKAN BOHRA.
       * Simple interest calculation program
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  PRINCIPAL      PIC 9(5)V99 VALUE 00000.00.
       01  RATE           PIC 99V99 VALUE 00.00.
       01  TIME           PIC 9(3)V99 VALUE 000.00.
       01  INTEREST       PIC 9(6)V99 VALUE 000000.00.
       PROCEDURE DIVISION.
           DISPLAY 'ENTER PRINCIPAL: ' WITH NO ADVANCING.
           ACCEPT PRINCIPAL.
           DISPLAY 'ENTER RATE OF INTEREST: ' WITH NO ADVANCING.
           ACCEPT RATE.
           DISPLAY 'ENTER TIME (YEARS): ' WITH NO ADVANCING.
           ACCEPT TIME.
           COMPUTE INTEREST = (PRINCIPAL * RATE * TIME) / 100.
           DISPLAY 'SIMPLE INTEREST IS: ' INTEREST.
           STOP RUN.